Tekla Open API Reference for Tekla Structures 2025
ClashCheckHandler Methods
The ClashCheckHandler type exposes the following members.
Methods
Name | Description
GetIntersectionBoundingBoxes
 Get a list of bounding boxes (AABB) of the clashing volumes of two objects.
RunClashCheck
 Starts the clash checking. Uses advanced options sa option values.
RunClashCheckWithOptions(Boolean, Boolean, Double, Boolean)
 Starts the clash checking with options.
RunClashCheckWithOptions(Boolean, Boolean, Boolean, Double, Boolean)
 Starts the clash checking with options.
StopClashCheck
 Stops the clash checking.
Top
See Also
Reference
ClashCheckHandler Class
Tekla.Structures.Model Namespace